# CurveIntersectResult Methods

---
The CurveIntersectResult type exposes the following members.
| Name| Description
---|---|---
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetOverlaps|  Gets information about the points shared between the two curves.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
CurveIntersectResult Class
Autodesk.Revit.DB Namespace